package com.sirlang;

public interface SirLangPrograms {
    String HELLO_WORLD_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это:\"Моя первая программа на языке Сударь!\"\n" +
            "Спасибо вам! Всего хорошего!";

    String HELLO_WORLD_PROGRAM_WITHOUT_COMMAS = "Приветствую!\n" +
            "\tСударь будьте добры выведите на экран это:\"Моя первая программа на языке Сударь!\"\n" +
            "Спасибо вам! Всего хорошего!";

    String HELLO_WORLD_PROGRAM_WITHOUT_COMMAS_AND_LOWER_CASE = "приветствую!\n" +
            "\tсударь будьте добры выведите на экран это:\"Моя первая программа на языке Сударь!\"\n" +
            "спасибо вам! всего хорошего!";

    String PROGRAM_WITHOUT_START = "Сударь, будьте добры, выведите на экран это:" +
            "\"Моя первая программа на языке Сударь!\"\nСпасибо вам! Всего хорошего!";

    String PROGRAM_WITHOUT_END = "Приветствую!\n\tСударь, будьте добры, выведите на экран это:" +
            "\"Моя первая программа на языке Сударь!\"\n";
}
