package com.sirlang;

public interface SirLangProgramCode {

    String PROGRAM_WITHOUT_START = "Сударь, будьте добры, выведите на экран это:" +
            "\"Моя первая программа на языке Сударь!\"\nСпасибо вам! Всего хорошего!";

    String PROGRAM_WITHOUT_END = "Приветствую!\n\tСударь, будьте добры, выведите на экран это:" +
            "\"Моя первая программа на языке Сударь!\"\n";

    String HELLO_WORLD_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это:\"Моя первая программа на языке Сударь!\"\n" +
            "Спасибо вам! Всего хорошего!";

    String HELLO_WORLD_PROGRAM_WITHOUT_COMMAS = "Приветствую!\n" +
            "\tСударь будьте добры выведите на экран это:\"Моя первая программа на языке Сударь!\"\n" +
            "Спасибо вам! Всего хорошего!";

    String HELLO_WORLD_PROGRAM_WITHOUT_COMMAS_AND_LOWER_CASE = "приветствую!\n" +
            "\tсударь будьте добры выведите на экран это:\"Моя первая программа на языке Сударь!\"\n" +
            "спасибо вам! всего хорошего!";

    String PRINT_BOOLEAN_TRUE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: правда\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_TRUE_PROGRAM_ANOTHER = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: тру\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_FALSE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: лошь\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_FALSE_PROGRAM_SECOND_VERSION = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: НЕПРАВДА\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_FALSE_PROGRAM_THIRD_VERSION = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: ОБман\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_DOUBLE_VALUE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 2.2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_DOUBLE_VALUE_PROGRAM_ANOTHER = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 2,2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_VALUE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 28784723222\n" +
            "Спасибо вам! Всего хорошего!";

    String HELLO_WORLD_PROGRAM_WITH_STRING_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как строка для первой программы:\"Моя первая программа на языке Сударь!\"\n" +
            "\tСударь, будьте добры, выведите на экран это:строка для первой программы\n" +
            "Спасибо вам! Всего хорошего!";
}
