package com.sirlang.program.concat;

public interface SirLangConcat {

    String PRINT_BOOLEAN_TRUE_PLUS_STRING = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: правда + \" это моя строка\"\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_STRING_PLUS_BOOLEAN_FALSE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: \"Это моя строка \" + ложь\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_STRING_PLUS_LONG_PLUS_DOUBLE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: \"СТРОКА С ЧИСЛАМИ = \" + 6 + 2,2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_PLUS_LONG_PLUS_STRING_PLUS_LONG_PLUS_DOUBLE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 2+2+ \"СТРОКА + С + 1,1 + ЧИСЛАМИ = \" + 6 + 2,2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_STRING_PLUS_LONG_PLUS_STRING_WITH_PLUS_IN_END = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: \"Это моя строка \" + 555 + \"Тестовая строка+\"\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_STRING_PLUS_LONG_PLUS_STRING_WITH_MINUS_IN_END = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: \"Это моя строка \" + 555 + \"Тестовая строка-\"\n" +
            "Спасибо вам! Всего хорошего!";

}
