package com.sirlang.program.expression;

public interface SirLangExpression {

    String PRINT_LONG_PLUS_LONG = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 55 + 45\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_MINUS_LONG = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 55 - 45\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_MULTIPLY_LONG = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 5 *8\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_DIVIDE_LONG = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 6/2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_DOUBLE_PLUS_DOUBLE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 2,2 + 0.8\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_DOUBLE_MINUS_DOUBLE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 2.2-0,2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_DOUBLE_MULTIPLY_DOUBLE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 4.6*0.5\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_DOUBLE_DIVIDE_DOUBLE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 2,2/2,2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_PLUS_DOUBLE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 6+2,2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_MINUS_DOUBLE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 6-2.5\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_MULTIPLY_DOUBLE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 6*2.5\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_DIVIDE_DOUBLE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 6/2.5\n" +
            "Спасибо вам! Всего хорошего!";

}
