package com.sirlang.program.print_datatypes;

public interface SirLangDataType {

    String PRINT_BOOLEAN_TRUE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: правда\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_TRUE_ANOTHER = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: тру\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_FALSE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: ложь\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_FALSE_SECOND_VERSION = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: НЕПРАВДА\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_FALSE_THIRD_VERSION = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: ОБман\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_DOUBLE_VALUE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 2.2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_DOUBLE_VALUE_ANOTHER = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 2,2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_VALUE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 28784723222\n" +
            "Спасибо вам! Всего хорошего!";

}
