package com.sirlang.program.vars;

public interface SirLangVar {

    String HELLO_WORLD_WITH_STRING_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как строка для первой программы:\"Моя первая программа на языке Сударь!\"\n" +
            "\tСударь, будьте добры, выведите на экран это:строка для первой программы\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_WITH_LONG_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как текущий год: 2019\n" +
            "\tСударь, будьте добры, выведите на экран это: текущий год\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_WITH_DOUBLE_WITH_COMMA_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как текущий год: 2019,1\n" +
            "\tСударь, будьте добры, выведите на экран это:текущий год\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_WITH_DOUBLE_WITH_POINT_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как текущий год: 2019.1\n" +
            "\tСударь, будьте добры, выведите на экран это: текущий год \n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_WITH_BOOLEAN_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как моя программа: правда\n" +
            "\tСударь, будьте добры, выведите на экран это:   моя программа \n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_WITH_DOUBLE_LONG_STRING_BOOLEAN_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как не моя программа: ложь\n" +
            "\tСударь, будьте добры, запомните это как лонг значение: 2019\n" +
            "\tСударь, будьте добры, запомните это как дабл с точкой: 2019.1\n" +
            "\tСударь, будьте добры, запомните это как доп строка: \"Моя строка\"\n" +
            "\tСударь, будьте добры, выведите на экран это: не моя программа\n" +
            "\tСударь, будьте добры, выведите на экран это: лонг значение\n" +
            "\tСударь, будьте добры, выведите на экран это: дабл с точкой\n" +
            "\tСударь, будьте добры, выведите на экран это: доп строка\n" +
            "Спасибо вам! Всего хорошего!";

}
