package com.sirlang.program.booleanexpression;

interface SirLangBooleanExpression {

    String PRINT_BOOLEAN_EXPRESSION_EQUALS_SIGN_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как мое условие: 1+1 = 5\n" +
            "\tСударь, будьте добры, выведите на экран это: мое условие\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_EXPRESSION_MORE_SIGN_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как мое условие: 1+1 > 5\n" +
            "\tСударь, будьте добры, выведите на экран это: мое условие\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_EXPRESSION_MORE_OR_EQUALS_SIGN_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как мое условие: 1 + 1 >= 2\n" +
            "\tСударь, будьте добры, выведите на экран это: мое условие\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_EXPRESSION_LESS_SIGN_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как мое условие: 1+1 < 5\n" +
            "\tСударь, будьте добры, выведите на экран это: мое условие\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_EXPRESSION_LESS_OR_EQUALS_SIGN_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как мое условие: 1+1 <= 2\n" +
            "\tСударь, будьте добры, выведите на экран это: мое условие\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_EXPRESSION_NOT_LESS_OR_EQUALS_SIGN_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как мое условие: не(1+1 <= 2)\n" +
            "\tСударь, будьте добры, выведите на экран это: мое условие\n" +
            "Спасибо вам! Всего хорошего!";

}
