package com.sirlang.program.booleanexpression;

interface SirLangBooleanExpression {

    String PRINT_BOOLEAN_EXPRESSION_EQUALS_SIGN_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как мое условие: 1+1 = 5\n" +
            "\tСударь, будьте добры, выведите на экран это: мое условие\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_EXPRESSION_MORE_SIGN_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как мое условие: 1+1 > 5\n" +
            "\tСударь, будьте добры, выведите на экран это: мое условие\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_EXPRESSION_MORE_OR_EQUALS_SIGN_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как мое условие: 1 + 1 >= 2\n" +
            "\tСударь, будьте добры, выведите на экран это: мое условие\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_EXPRESSION_LESS_SIGN_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как мое условие: 1+1 < 5\n" +
            "\tСударь, будьте добры, выведите на экран это: мое условие\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_EXPRESSION_LESS_OR_EQUALS_SIGN_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как мое условие: 1+1 <= 2\n" +
            "\tСударь, будьте добры, выведите на экран это: мое условие\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_EXPRESSION_NOT_LESS_OR_EQUALS_SIGN_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как мое условие: не(1+1 <= 2)\n" +
            "\tСударь, будьте добры, выведите на экран это: мое условие\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_EXPRESSION_NOT_NOT_FALSE_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как мое условие: не(не(ложь))\n" +
            "\tСударь, будьте добры, выведите на экран это: мое условие\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_EXPRESSION_NOT_NOT_FALSE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: не(не(ложь))\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_EXPRESSION_TRUE_AND_FALSE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: правда и ложь\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_EXPRESSION_TRUE_OR_FALSE = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: правда или ложь\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_EXPRESSION_NOT_TRUE_AND_FALSE_OR_TRUE_AND_TRUE_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как мое условие: не(правда и ложь) или правда и правда\n" +
            "\tСударь, будьте добры, выведите на экран это: мое условие\n" +
            "Спасибо вам! Всего хорошего!";

}
