package com.sirlang.program.var;

public interface SirLangVar {

    String HELLO_WORLD = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это:\"Моя первая программа на языке Сударь!\"\n" +
            "Спасибо вам! Всего хорошего!";

    String HELLO_WORLD_WITHOUT_COMMAS = "Приветствую!\n" +
            "\tСударь будьте добры выведите на экран это:\"Моя первая программа на языке Сударь!\"\n" +
            "Спасибо вам! Всего хорошего!";

    String HELLO_WORLD_WITHOUT_COMMAS_AND_LOWER_CASE = "приветствую!\n" +
            "\tсударь будьте добры выведите на экран это:\"Моя первая программа на языке Сударь!\"\n" +
            "спасибо вам! всего хорошего!";

}
