package com.sirlang.program.concatvars;

public interface SirLangConcatVars {

    String PRINT_STRING_VAR_PLUS_STRING_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как моя программа: правда\n" +
            "\tСударь, будьте добры, выведите на экран это:   моя программа \n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_STRING_VAR_PLUS_LONG_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как моя программа: правда\n" +
            "\tСударь, будьте добры, выведите на экран это:   моя программа \n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_STRING_VAR_PLUS_DOUBLE_WITH_COMMA_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как моя программа: правда\n" +
            "\tСударь, будьте добры, выведите на экран это:   моя программа \n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_STRING_VAR_PLUS_DOUBLE_WITH_POINT_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как моя программа: правда\n" +
            "\tСударь, будьте добры, выведите на экран это:   моя программа \n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_STRING_VAR_PLUS_BOOLEAN_TRUE_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как моя программа: правда\n" +
            "\tСударь, будьте добры, выведите на экран это:   моя программа \n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_STRING_VAR_PLUS_BOOLEAN_FALSE_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как моя программа: правда\n" +
            "\tСударь, будьте добры, выведите на экран это:   моя программа \n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_VAR_PLUS_DOUBLE_WITH_COMMA_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как моя программа: правда\n" +
            "\tСударь, будьте добры, выведите на экран это:   моя программа \n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_VAR_PLUS_DOUBLE_WITH_POINT_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как моя программа: правда\n" +
            "\tСударь, будьте добры, выведите на экран это:   моя программа \n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_DOUBLE_WITH_COMMA_VAR_PLUS_DOUBLE_WITH_POINT_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как моя программа: правда\n" +
            "\tСударь, будьте добры, выведите на экран это:   моя программа \n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_VAR_PLUS_LONG_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как моя программа: правда\n" +
            "\tСударь, будьте добры, выведите на экран это:   моя программа \n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_VAR_PLUS_STRING_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как моя программа: правда\n" +
            "\tСударь, будьте добры, выведите на экран это:   моя программа \n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_VAR_PLUS_STRING_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как моя программа: правда\n" +
            "\tСударь, будьте добры, выведите на экран это:   моя программа \n" +
            "Спасибо вам! Всего хорошего!";
}
