package com.sirlang.program;

public interface SirLangPrintProgramCode {

    String PROGRAM_WITHOUT_START = "Сударь, будьте добры, выведите на экран это:" +
            "\"Моя первая программа на языке Сударь!\"\nСпасибо вам! Всего хорошего!";

    String PROGRAM_WITHOUT_END = "Приветствую!\n\tСударь, будьте добры, выведите на экран это:" +
            "\"Моя первая программа на языке Сударь!\"\n";

    String HELLO_WORLD_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это:\"Моя первая программа на языке Сударь!\"\n" +
            "Спасибо вам! Всего хорошего!";

    String HELLO_WORLD_PROGRAM_WITHOUT_COMMAS = "Приветствую!\n" +
            "\tСударь будьте добры выведите на экран это:\"Моя первая программа на языке Сударь!\"\n" +
            "Спасибо вам! Всего хорошего!";

    String HELLO_WORLD_PROGRAM_WITHOUT_COMMAS_AND_LOWER_CASE = "приветствую!\n" +
            "\tсударь будьте добры выведите на экран это:\"Моя первая программа на языке Сударь!\"\n" +
            "спасибо вам! всего хорошего!";

    String PRINT_BOOLEAN_TRUE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: правда\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_TRUE_PROGRAM_ANOTHER = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: тру\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_FALSE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: ложь\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_FALSE_PROGRAM_SECOND_VERSION = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: НЕПРАВДА\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_FALSE_PROGRAM_THIRD_VERSION = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: ОБман\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_DOUBLE_VALUE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 2.2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_DOUBLE_VALUE_PROGRAM_ANOTHER = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 2,2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_VALUE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 28784723222\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_PLUS_LONG_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 55 + 45\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_MINUS_LONG_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 55 - 45\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_MULTIPLY_LONG_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 5 *8\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_DIVIDE_LONG_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 6/2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_DOUBLE_PLUS_DOUBLE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 2,2 + 0.8\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_DOUBLE_MINUS_DOUBLE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 2.2-0,2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_DOUBLE_MULTIPLY_DOUBLE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 4.6*0.5\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_DOUBLE_DIVIDE_DOUBLE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 2,2/2,2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_PLUS_DOUBLE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 6+2,2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_MINUS_DOUBLE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 6-2.5\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_MULTIPLY_DOUBLE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 6*2.5\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_DIVIDE_DOUBLE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 6/2.5\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_BOOLEAN_TRUE_PLUS_STRING_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: правда + \" это моя строка\"\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_STRING_PLUS_BOOLEAN_FALSE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: \"Это моя строка \" + ложь\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_STRING_PLUS_LONG_PLUS_DOUBLE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: \"СТРОКА С ЧИСЛАМИ = \" + 6 + 2,2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_LONG_PLUS_LONG_PLUS_STRING_PLUS_LONG_PLUS_DOUBLE_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: 2+2+ \"СТРОКА + С + 1,1 + ЧИСЛАМИ = \" + 6 + 2,2\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_STRING_PLUS_LONG_PLUS_STRING_WITH_PLUS_IN_END_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: \"Это моя строка \" + 555 + \"Тестовая строка+\"\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_STRING_PLUS_LONG_PLUS_STRING_WITH_MINUS_IN_END_PROGRAM = "Приветствую!\n" +
            "\tСударь, будьте добры, выведите на экран это: \"Это моя строка \" + 555 + \"Тестовая строка-\"\n" +
            "Спасибо вам! Всего хорошего!";

    String HELLO_WORLD_PROGRAM_WITH_STRING_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как строка для первой программы:\"Моя первая программа на языке Сударь!\"\n" +
            "\tСударь, будьте добры, выведите на экран это:строка для первой программы\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_PROGRAM_WITH_LONG_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как текущий год: 2019\n" +
            "\tСударь, будьте добры, выведите на экран это:строка для первой программы\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_PROGRAM_WITH_DOUBLE_WITH_COMMA_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как текущий год: 2019,1\n" +
            "\tСударь, будьте добры, выведите на экран это:строка для первой программы\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_PROGRAM_WITH_DOUBLE_WITH_POINT_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как текущий год: 2019.1\n" +
            "\tСударь, будьте добры, выведите на экран это:строка для первой программы\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_PROGRAM_WITH_BOOLEAN_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как моя программа: правда\n" +
            "\tСударь, будьте добры, выведите на экран это:строка для первой программы\n" +
            "Спасибо вам! Всего хорошего!";

    String PRINT_PROGRAM_WITH_DOUBLE_LONG_STRING_BOOLEAN_VAR = "Приветствую!\n" +
            "\tСударь, будьте добры, запомните это как не моя программа: ложь\n" +
            "\tСударь, будьте добры, запомните это как лонг значение: 21\n" +
            "\tСударь, будьте добры, запомните это как дабл с точкой: 2.1\n" +
            "\tСударь, будьте добры, запомните это как доп строка: \"Моя строка\"\n" +
            "\tСударь, будьте добры, выведите на экран это: не моя программа\n" +
            "\tСударь, будьте добры, выведите на экран это: лонг значение\n" +
            "\tСударь, будьте добры, выведите на экран это: дабл с точкой\n" +
            "\tСударь, будьте добры, выведите на экран это: доп строка\n" +
            "Спасибо вам! Всего хорошего!";
}
